docs/graphs/dm.dot
graph DrUML {
    graph [label = "Dr. UML"; rankdir = "TB";];
    
    node [shape = record;];

    User [label = "{User | id | name}";];
    UMLProject [label = "{UMLProject | id | name | lastEdit}";];
    UMLDiagram [label = "{UMLDiagram | filename | type | backgroundColor | lastEdit}";];
    Gadget [label = "{Gadget | id | type | color | position}";];
    Association [label = "{Association | id | type | color | position}";];
    Submodule [label = "{Submodule | id| name | Attribute | lastEdit}";];
    Session [label = "{Session | id| host | startTime | status}";];
    Chatroom [label = "{Chatroom}";];
    Message [label = "{Message | id | sender | content | timestamp}";];
    Attribute [label = "{Attribute | id | content | position}";];
    TextStyle [label = "{TextStyle | font | fontSize | isBold | isItalic | isUnderline}";];
    
    User -- UMLProject [label = "manages"; headlabel = "*"; taillabel = "1";];
    UMLProject -- UMLDiagram [label = "manages"; headlabel = "*"; taillabel = "1";];
    UMLDiagram -- Gadget [label = "consists of"; headlabel = "*"; taillabel = "1";];
    Submodule -- Gadget [label = "consists of"; headlabel = "*"; taillabel = "1";];
    Gadget -- Attribute [label = "contains"; headlabel = "*"; taillabel = "1";];
    Association -- Attribute [label = "contains"; headlabel = "*"; taillabel = "1";];
    Gadget -- Association [label = "Asscotiates"; headlabel = "*"; taillabel = "1..2";];
    UMLDiagram -- Submodule [label = "consists of"; headlabel = "*"; taillabel = "1";];
    User -- Session [label = "hosts"; headlabel = "1"; taillabel = "1";];
    User -- Session [label = "joins"; headlabel = "1"; taillabel = "*";];
    Session -- UMLProject [label = "connects"; headlabel = "1"; taillabel = "1";];
    Session -- Chatroom [label = "contains"; headlabel = "1"; taillabel = "1";];
    Chatroom -- Message [label = "contains"; headlabel = "*"; taillabel = "1";];
    User -- Message [label = "sends"; headlabel = "*"; taillabel = "1";];
    Attribute -- TextStyle [label = "described by"; headlabel = "1"; taillabel = "1";];
}
